In [1]:
%reload_ext sql

In [3]:
DB_ENDPOINT = "127.0.0.1"
DB = 'pagila'
DB_USER = 'postgres'
DB_PASSWORD = '[Rangashri123]'
DB_PORT = '5432'

#postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}"\
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)
print(conn_string)
%sql $conn_string

postgresql://postgres:[Rangashri123]@127.0.0.1:5432/pagila

'Connected: postgres@pagila'

In [4]:
#Insight 1 : top Grossing Movies
%%sql 
select film_id, title, release_year, rental_rate, rating from film limit 5;

SyntaxError: invalid syntax (<ipython-input-4-5b99139be1a0>, line 3)

In [10]:
%%sql
select film_id, title, release_year,rental_rate, rating from film limit 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(1, 'ACADEMY DINOSAUR', 2006, Decimal('0.99'), 'PG'),
 (2, 'ACE GOLDFINGER', 2006, Decimal('4.99'), 'G'),
 (3, 'ADAPTATION HOLES', 2006, Decimal('2.99'), 'NC-17'),
 (4, 'AFFAIR PREJUDICE', 2006, Decimal('2.99'), 'G'),
 (5, 'AFRICAN EGG', 2006, Decimal('2.99'), 'G')]

In [13]:
%%sql
select * from payment limit 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(16050, 269, 2, 7, Decimal('1.99'), datetime.datetime(2017, 1, 24, 21, 40, 19, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=-360, name=None))),
 (16051, 269, 1, 98, Decimal('0.99'), datetime.datetime(2017, 1, 25, 15, 16, 50, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=-360, name=None))),
 (16052, 269, 2, 678, Decimal('6.99'), datetime.datetime(2017, 1, 28, 21, 44, 14, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=-360, name=None))),
 (16053, 269, 2, 703, Decimal('0.99'), datetime.datetime(2017, 1, 29, 0, 58, 2, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=-360, name=None))),
 (16054, 269, 1, 750, Decimal('4.99'), datetime.datetime(2017, 1, 29, 8, 10, 6, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=-360, name=None)))]

In [14]:
%%sql
select * from inventory limit 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(1, 1, 1, datetime.datetime(2017, 2, 15, 10, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=-360, name=None))),
 (2, 1, 1, datetime.datetime(2017, 2, 15, 10, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=-360, name=None))),
 (3, 1, 1, datetime.datetime(2017, 2, 15, 10, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=-360, name=None))),
 (4, 1, 1, datetime.datetime(2017, 2, 15, 10, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=-360, name=None))),
 (5, 1, 2, datetime.datetime(2017, 2, 15, 10, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=-360, name=None)))]

In [16]:
%%sql
select f.title, p.amount, p.payment_date, p.customer_id
from payment p
JOIN rental r ON (p.rental_id = r.rental_id)
JOIN inventory i ON (r.inventory_id = i.inventory_id)
JOIN film f on (i.film_id = f.film_id)
limit 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[('SWARM GOLD', Decimal('1.99'), datetime.datetime(2017, 1, 24, 21, 40, 19, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=-360, name=None)), 269),
 ('PACKER MADIGAN', Decimal('0.99'), datetime.datetime(2017, 1, 25, 15, 16, 50, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=-360, name=None)), 269),
 ('SOMETHING DUCK', Decimal('6.99'), datetime.datetime(2017, 1, 28, 21, 44, 14, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=-360, name=None)), 269),
 ('DRACULA CRYSTAL', Decimal('0.99'), datetime.datetime(2017, 1, 29, 0, 58, 2, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=-360, name=None)), 269),
 ('CLOSER BANG', Decimal('4.99'), datetime.datetime(2017, 1, 29, 8, 10, 6, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=-360, name=None)), 269)]

In [19]:

%%sql
select f.title, sum(p.amount) as revenue
from payment p
JOIN rental r ON (p.rental_id = r.rental_id)
JOIN inventory i ON (r.inventory_id = i.inventory_id)
JOIN film f on (i.film_id = f.film_id)
group by f.title
ORDER BY revenue desc
limit 10;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.

[('TELEGRAPH VOYAGE', Decimal('231.73')),
 ('WIFE TURN', Decimal('215.70')),
 ('ZORRO ARK', Decimal('214.69')),
 ('GOODFELLAS SALUTE', Decimal('209.69')),
 ('TITANS JERK', Decimal('201.71')),
 ('SATURDAY LAMBS', Decimal('195.73')),
 ('HARRY IDAHO', Decimal('195.70')),
 ('INNOCENT USUAL', Decimal('191.74')),
 ('HUSTLER PARTY', Decimal('190.78')),
 ('TORQUE BOUND', Decimal('189.73'))]

In [24]:
%%sql
select p.customer_id, p.rental_id,ci.city,  p.amount 
from payment p
JOIN customer c ON (p.customer_id = c.customer_id)
JOIN address a ON(c.address_id = c.address_id)
JOIN city ci on (ci.city_id = a.city_id)
order by p.payment_date
limit 10;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.

[(130, 1, 'Jining', Decimal('2.99')),
 (130, 1, 'Juiz de Fora', Decimal('2.99')),
 (130, 1, 'Sullana', Decimal('2.99')),
 (130, 1, 'Jinzhou', Decimal('2.99')),
 (130, 1, 'Garden Grove', Decimal('2.99')),
 (130, 1, 'Szkesfehrvr', Decimal('2.99')),
 (130, 1, 'Tieli', Decimal('2.99')),
 (130, 1, 'Lausanne', Decimal('2.99')),
 (130, 1, 'Patras', Decimal('2.99')),
 (130, 1, 'al-Manama', Decimal('2.99'))]

In [25]:
%%sql
select ci.city,  sum(p.amount) as revenue
from payment p
JOIN customer c ON (p.customer_id = c.customer_id)
JOIN address a ON(c.address_id = c.address_id)
JOIN city ci on (ci.city_id = a.city_id)
group by ci.city
order by revenue desc
limit 10;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.

[('Lethbridge', Decimal('132410.60')),
 ('Aurora', Decimal('132410.60')),
 ('London', Decimal('132410.60')),
 ('Woodridge', Decimal('132410.60')),
 ('Addis Abeba', Decimal('66205.30')),
 ('Aden', Decimal('66205.30')),
 ('Abu Dhabi', Decimal('66205.30')),
 ('Akishima', Decimal('66205.30')),
 ('Adana', Decimal('66205.30')),
 ('Ahmadnagar', Decimal('66205.30'))]

In [26]:
%%sql
select  sum(p.amount) as revenue,EXTRACT(month FROM p.payment_date) as Month 
from payment p
group by month
order by revenue desc
limit 10;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(Decimal('27427.06'), 4.0),
 (Decimal('23886.56'), 3.0),
 (Decimal('9631.88'), 2.0),
 (Decimal('4745.62'), 1.0),
 (Decimal('514.18'), 5.0)]

In [27]:
%%sql
select f.title, p.amount, p.payment_date, p.customer_id,EXTRACT(month FROM p.payment_date)
from payment p
JOIN rental r ON (p.rental_id = r.rental_id)
JOIN inventory i ON (r.inventory_id = i.inventory_id)
JOIN film f on (i.film_id = f.film_id)
JOIN customer c ON (p.customer_id = c.customer_id)
JOIN address a ON(c.address_id = c.address_id)
JOIN city ci on (ci.city_id = a.city_id)
order by p.payment_date
limit 10;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.

[('BLANKET BEVERLY', Decimal('2.99'), datetime.datetime(2017, 1, 24, 21, 21, 56, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=-360, name=None)), 130, 1.0),
 ('BLANKET BEVERLY', Decimal('2.99'), datetime.datetime(2017, 1, 24, 21, 21, 56, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=-360, name=None)), 130, 1.0),
 ('BLANKET BEVERLY', Decimal('2.99'), datetime.datetime(2017, 1, 24, 21, 21, 56, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=-360, name=None)), 130, 1.0),
 ('BLANKET BEVERLY', Decimal('2.99'), datetime.datetime(2017, 1, 24, 21, 21, 56, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=-360, name=None)), 130, 1.0),
 ('BLANKET BEVERLY', Decimal('2.99'), datetime.datetime(2017, 1, 24, 21, 21, 56, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=-360, name=None)), 130, 1.0),
 ('BLANKET BEVERLY', Decimal('2.99'), datetime.datetime(2017, 1, 24, 21, 21, 56, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=-360, name=None)), 130, 1.0),
 ('BLANKET BEVERLY', Decimal('2.99'), datetime.datetime(2017, 1, 24, 21, 21, 56, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=-360, name=None)), 130, 1.0),
 ('BLANKET BEVERLY', Decimal('2.99'), datetime.datetime(2017, 1, 24, 21, 21, 56, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=-360, name=None)), 130, 1.0),
 ('BLANKET BEVERLY', Decimal('2.99'), datetime.datetime(2017, 1, 24, 21, 21, 56, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=-360, name=None)), 130, 1.0),
 ('BLANKET BEVERLY', Decimal('2.99'), datetime.datetime(2017, 1, 24, 21, 21, 56, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=-360, name=None)), 130, 1.0)]

In [ ]:
%%sql
select f.title,ci.city, sum(p.amount) as revenue, EXTRACT(month from p.payment_date) as month
from payment p
JOIN rental r ON (p.rental_id = r.rental_id)
JOIN inventory i ON (r.inventory_id = i.inventory_id)
JOIN film f on (i.film_id = f.film_id)
JOIN customer c ON (p.customer_id = c.customer_id)
JOIN address a ON(c.address_id = c.address_id)
JOIN city ci on (ci.city_id = a.city_id)
group by f.title, ci.city, month
order by month, revenue desc
limit 10;

 * postgresql://postgres:***@127.0.0.1:5432/pagila